analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/max32690.svd
    <register>
     <name>INTFL</name>
     <description>Interrupt Flags Register.</description>
     <addressOffset>0x54</addressOffset>
     <fields>
      <field>
       <name>READY</name>
       <description>ADC is ready.</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>ABORT</name>
       <description>Conversion start is aborted.</description>
       <bitRange>[2:2]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>START_DET</name>
       <description>Conversion start is detected.</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>SEQ_STARTED</name>
       <bitRange>[4:4]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>SEQ_DONE</name>
       <bitRange>[5:5]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>CONV_DONE</name>
       <bitRange>[6:6]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>CLIPPED</name>
       <bitRange>[7:7]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>FIFO_LVL</name>
       <bitRange>[8:8]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>FIFO_UFL</name>
       <bitRange>[9:9]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>FIFO_OFL</name>
       <bitRange>[10:10]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
     </fields>
    </register>
    <register>
     <name>SFRADDROFFSET</name>
     <description>SFR Address Offset Register</description>
     <addressOffset>0x60</addressOffset>
     <fields>
      <field>
       <name>OFFSET</name>
       <description>Address Offset for SAR Digital</description>
       <bitRange>[7:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SFRADDR</name>
     <description>SFR Address Register</description>
     <addressOffset>0x64</addressOffset>
     <fields>
      <field>
       <name>ADDR</name>
       <description>Address to SAR Digital</description>
       <bitRange>[7:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SFRWRDATA</name>
     <description>SFR Write Data Register</description>
     <addressOffset>0x68</addressOffset>
     <fields>
      <field>
       <name>DATA</name>
       <description>DATA to SAR Digital</description>
       <bitRange>[7:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SFRRDDATA</name>
     <description>SFR Read Data Register</description>
     <addressOffset>0x6C</addressOffset>
     <fields>
      <field>
       <name>DATA</name>
       <description>DATA from SAR Digital</description>
       <bitRange>[7:0]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SFRSTATUS</name>
     <description>SFR Status Register</description>
     <addressOffset>0x70</addressOffset>
     <fields>
      <field>
       <name>NACK</name>
       <description>NACK status for SAR Digital SFR communication</description>
       <bitRange>[0:0]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>
<!--ADC Inter-Integrated Circuit.-->
  <peripheral>
   <name>AESKEYS</name>
   <description>AES Key Registers.</description>
   <baseAddress>0x40005000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>KEY0</name>
     <description>AES Key 0.</description>
     <addressOffset>0x000</addressOffset>
     <size>128</size>
    </register>
    <register>
     <name>KEY1</name>
     <description>AES Key 1.</description>
     <addressOffset>0x010</addressOffset>
     <size>128</size>
    </register>
   </registers>
  </peripheral>
<!--AESKEYS AES Key Registers.-->
  <peripheral>
   <name>CAN0</name>
   <description>Controller Area Network Registers</description>
   <baseAddress>0x40064000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>MODE</name>
     <description>Mode Register.</description>
     <addressOffset>0x0000</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>AFM</name>
       <description>Hardware acceptance filter scheme.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LOM</name>
       <description>Listen Only Mode.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RST</name>
       <description>Reset Mode.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RXTRIG</name>
       <description>Receive FIFO trigger in 32bit word.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>3</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>1W</name>
         <description>1 word</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>4W</name>
         <description>4 word</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>8W</name>
         <description>8 word</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>16W</name>
         <description>16 word</description>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>32W</name>
         <description>32 word</description>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>64W</name>
         <description>64 word</description>
         <value>5</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>DMA</name>
       <description>Enable DMA mode.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SLP</name>
       <description>Sleep mode.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>enter</name>
         <description>Enter sleep mode.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>leave</name>
         <description>Leave sleep mode.</description>
         <value>0</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>CMD</name>
     <description>Command Register.</description>
     <addressOffset>0x0001</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>ABORT</name>
       <description>Abort Transmission</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TXREQ</name>
       <description>Transmit Request.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>STAT</name>
     <description>Status Register.</description>
     <addressOffset>0x0002</addressOffset>
     <size>8</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>BUS_OFF</name>
       <description>Bus off Status.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERR</name>
       <description>Error Status.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TX</name>
       <description>Transmit Status.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RX</name>
       <description>Receive Status.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TXBUF</name>
       <description>Transmit Buffer Status.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DOR</name>
       <description>Data Overrun Status.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RXBUF</name>
       <description>Receive Buffer Status.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>INTFL</name>
     <description>Interrupt Status Register.</description>
     <addressOffset>0x0003</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>DOR</name>
       <description>Data Overrun Interrupt.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BERR</name>
       <description>Bus Error Interrupt.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TX</name>
       <description>Transmission Interrupt.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RX</name>
       <description>Receive Interrupt.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERPSV</name>
       <description>Error Passive Interrupt.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERWARN</name>
       <description>Error Warning Interrupt.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AL</name>
       <description>Arbitration Lost Interrupt.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>WU</name>
       <description>Wake-up Interrupt.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>INTEN</name>
     <description>Interrupt Enable Register.</description>
     <addressOffset>0x0004</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>DOR</name>
       <description>Data Overrun Interrupt.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BERR</name>
       <description>Bus Error Interrupt.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TX</name>
       <description>Transmit Interrupt.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RX</name>
       <description>Receive Interrupt.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERPSV</name>
       <description>Error Passive Interrupt.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERWARN</name>
       <description>Error Warning Interrupt.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AL</name>
       <description>Arbitration Lost Interrupt.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>WU</name>
       <description>Wakeup interrupt.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>RMC</name>
     <description>Receive Message Counter Register.</description>
     <addressOffset>0x0005</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>NUM_MSGS</name>
       <description>Number of stored message frames.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BUSTIM0</name>
     <description>Bus Timing Register 0.</description>
     <addressOffset>0x0006</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>BR_CLKDIV</name>
       <description>Baud Rate Prescaler.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
      <field>
       <name>SJW</name>
       <description>Synchronization Jump Width.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BUSTIM1</name>
     <description>Bus Timing Register 1.</description>
     <addressOffset>0x0007</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>TSEG1</name>
       <description>Number of clock cycles per Time Segment 1</description>
       <bitOffset>0</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>TSEG2</name>
       <description>Number of clock cycles per Time Segment 2</description>
       <bitOffset>4</bitOffset>
       <bitWidth>3</bitWidth>
      </field>
      <field>
       <name>SAM</name>
       <description>Number of bus level samples.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TXFIFO32</name>
     <description>Transmit FIFO Register.</description>
     <addressOffset>0x0008</addressOffset>
     <size>32</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Write to put into TX FIFO.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>2</dim>
     <dimIncrement>2</dimIncrement>
     <name>TXFIFO16[%s]</name>
     <description>Transmit FIFO Register.</description>
     <addressOffset>0x0008</addressOffset>
     <size>16</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Write to put into TX FIFO.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>1</dimIncrement>
     <name>TXFIFO8[%s]</name>
     <description>Transmit FIFO Register.</description>
     <addressOffset>0x0008</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Write to put into TX FIFO.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>RXFIFO32</name>
     <description>Receive FIFO Register.</description>
     <addressOffset>0x000C</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Read from RX FIFO.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>2</dim>
     <dimIncrement>2</dimIncrement>
     <name>RXFIFO16[%s]</name>
     <description>Receive FIFO Register.</description>
     <addressOffset>0x000C</addressOffset>
     <size>16</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Read from RX FIFO.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>1</dimIncrement>
     <name>RXFIFO8[%s]</name>
     <description>Receive FIFO Register.</description>
     <addressOffset>0x000C</addressOffset>
     <size>8</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Read from RX FIFO.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ACR32</name>
     <description>Acceptance Code Register.</description>
     <addressOffset>0x0010</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>ACR</name>
       <description>Acceptance Code.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>2</dim>
     <dimIncrement>2</dimIncrement>
     <name>ACR16[%s]</name>
     <description>Acceptance Code Register.</description>
     <addressOffset>0x0010</addressOffset>
     <size>16</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>ACR</name>
       <description>Acceptance Code.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>1</dimIncrement>
     <name>ACR8[%s]</name>
     <description>Acceptance Code Register.</description>
     <addressOffset>0x0010</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>ACR</name>
       <description>Acceptance Code.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>AMR32</name>
     <description>Acceptance Mask Register.</description>
     <addressOffset>0x0014</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>AMR</name>
       <description>Acceptance Mask.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>2</dim>
     <dimIncrement>2</dimIncrement>
     <name>AMR16[%s]</name>
     <description>Acceptance Mask Register.</description>
     <addressOffset>0x0014</addressOffset>
     <size>16</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>AMR</name>
       <description>Acceptance Mask.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>1</dimIncrement>
     <name>AMR8[%s]</name>
     <description>Acceptance Mask Register.</description>
     <addressOffset>0x0014</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>AMR</name>
       <description>Acceptance Mask.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ECC</name>
     <description>Error Code Capture Register.</description>
     <addressOffset>0x0018</addressOffset>
     <size>8</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>BER</name>
       <description>Bit Error Occurred.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>STFER</name>
       <description>Stuff Error Occurred.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CRCER</name>
       <description>CRC Error Occurred.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FRMER</name>
       <description>Form Error Occurred.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ACKER</name>
       <description>ACK Error Occurred.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>EDIR</name>
       <description>Direction of transfer while error occurred.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>TX</name>
         <description>Transmission</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>RX</name>
         <description>Reception</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TXWRN</name>
       <description>Set when TXERR counter is greater than or equal to 96.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RXWRN</name>
       <description>Set when RXERR counter is greater than or equal to 96.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>RXERR</name>
     <description>Receive Error Counter.</description>
     <addressOffset>0x0019</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>RXERR</name>
       <description>Receive Error Counter.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TXERR</name>
     <description>Invalidate All Registers.</description>
     <addressOffset>0x001A</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>TXERR</name>
       <description>Transmit Error Counter.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ALC</name>
     <description>Arbitration Lost Code Capture Register.</description>
     <addressOffset>0x001B</addressOffset>
     <size>8</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>ALC</name>
       <description>Arbitration Lost Capture.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
     </fields>
    </register>
