analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/max32690.svd
    <register>
     <name>NBT</name>
     <description>Nominal Bit Timing Register.</description>
     <addressOffset>0x001C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>NBRP</name>
       <description>Baudrate Prescaler Used in Arbitration Phase.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>10</bitWidth>
      </field>
      <field>
       <name>NSEG1</name>
       <description>The time segment before the sample point in Abritration Phase.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
      <field>
       <name>NSEG2</name>
       <description>The time segment after the sample point in Abritration Phase.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>NSJW</name>
       <description>Synchronization Jump Width in Arbitration Phase.</description>
       <bitOffset>25</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>DBT_SSPP</name>
     <description>Data Bit Timing Register.</description>
     <addressOffset>0x0020</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>DBRP</name>
       <description>Baudrate Prescaler in Data Phase.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>10</bitWidth>
      </field>
      <field>
       <name>DSEG1</name>
       <description>The time segment before the sample point in Data Phase.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
      <field>
       <name>DSEG2</name>
       <description>The time segment before the sample point in Data Phase.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>DSJW</name>
       <description>Synchronization Jump Width in Data Phase</description>
       <bitOffset>20</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>SSPP</name>
       <description>Position of the secondary sample point.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FDCTRL</name>
     <description>FD Control Register.</description>
     <addressOffset>0x0024</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>FDEN</name>
       <description>FD Frame format/ Extended data length. This bit indicates CAN FD frame format.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>fd</name>
         <description>CAN FD Frame Format</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>classic</name>
         <description>Classic CAN Frame Format.</description>
         <value>0</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>BRSEN</name>
       <description>This bit indicates whether the bit rate is switched in Data phase.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>NOSW</name>
         <description>Bit rate is not switced inside of CAN FD frame.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SW</name>
         <description>Bit rate is switched from nominal bit rate of the arbitration phase to alternate bit rate of data phase.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>EXTBT</name>
       <description>This bit configure the Bit Time prescaler in Arbitration phase.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>BT</name>
         <description>Use contents of BT register to configure bit time in arbitration phase.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>NBT</name>
         <description>Use contents of NBT register to configure bit time in arbitration phase.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ISO</name>
       <description>ISO CAN FD Format Selection.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>BOSCH</name>
         <description>Frame format according to Bosch CAN FD specification.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ISO</name>
         <description>Frame format according to ISO 11898 1, 2015.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>DAR</name>
       <description>Disable Auto Retransmission</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>EN</name>
         <description>Automatic retransmission enabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DIS</name>
         <description>Automatic retransmission disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>REOM</name>
       <description>Restricted Operation Mode.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>PED</name>
       <description>Protocol Exception Disable.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FDSTAT</name>
     <description>Invalidate All Registers.</description>
     <addressOffset>0x0025</addressOffset>
     <size>8</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>BITERR</name>
       <description>Bit Error Indicator. When this bit is set the inconsistency occurs between the transmitted and the received bit in CAN FD frame.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CRCERR</name>
       <description>Cyclic Redundancy Check Error indicator. This indicates that calculated CRC is different from received in CAN FD frame</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FRMERR</name>
       <description>Form Error indicator. This bit indicates, that a fixed form bit field contains at least one illegal bit in Data phase of CAN FD frame with the BRS 
bit set</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>STFERR</name>
       <description>Stuff Error Indicator. This bit indicates stuff error occurred in Data phase in CAN FD frame with the BRS bit set
</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>PEE</name>
       <description>Protocol Exception Event indicator. Indicates that core detects recessive state on res position and enter to Bus integration state.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>STATE</name>
       <description>Operation state.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>INT</name>
         <description>Waiting for 11 recessive bit after reset or bus off</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>IDLE</name>
         <description>Waiting for Start of Frame.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>RX</name>
         <description>Node operating as Receiver.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>TX</name>
         <description>Node operating as Transmitter.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>DPERR</name>
     <description>Data Phase Error Counter Register.</description>
     <addressOffset>0x0026</addressOffset>
     <size>8</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>DPERR</name>
       <description>Data Phase Error Counter.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>APERR</name>
     <description>Arbitration Phase Error Counter Register.</description>
     <addressOffset>0x0027</addressOffset>
     <size>8</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>APERR</name>
       <description>Arbitration Error Counter.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TEST</name>
     <description>Invalidate All Registers.</description>
     <addressOffset>0x0028</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>LBEN</name>
       <description>Loopback mode.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TXC</name>
       <description>Transmitted frame.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>WUPCLKDIV</name>
     <description>Wake-up timer prescaler.</description>
     <addressOffset>0x0029</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>WUPDIV</name>
       <description>Wake-up timer prescaler.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>WUPFT</name>
     <description>Wake up Filter Time Register.</description>
     <addressOffset>0x002A</addressOffset>
     <size>16</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>WUPFT</name>
       <description>Wake-up pattern filter time.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>WUPET</name>
     <description>Wake-up Expire Time Register.</description>
     <addressOffset>0x002C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>WUPET</name>
       <description>Wake up patter expire time.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>20</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>RXDCNT</name>
     <description>RX FIFO Data Counter Register.</description>
     <addressOffset>0x0030</addressOffset>
     <size>16</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>RXDCNT</name>
       <description>RX FIFO data counter.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TXSCNT</name>
     <description>TX FIFO Space Counter.</description>
     <addressOffset>0x0032</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>TXSCNT</name>
       <description>TX FIFO Space Counter.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TXDECMP</name>
     <description>Invalidate All Registers.</description>
     <addressOffset>0x0033</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>TDCO</name>
       <description>Transceiver Delay Compensation Offset. This bit field contains the offset value added to the measured transceiver loop delay</description>
       <bitOffset>0</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>TDCEN</name>
       <description>Transceiver Delay Compensation Enable.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>EINTFL</name>
     <description>Extended Interrupt Flag Register.</description>
     <addressOffset>0x0034</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>RX_THD</name>
       <description>RX FIFO reach programmed trigger level, it is set when the RX FIFO reaches programmed trigger level (RT[2:0] in MR register). To clear the 
RXFT interrupt, write this bit 1</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RX_TO</name>
       <description>RX FIFO Timeout Indicator. It is set when there is no write or read from/in to RX FIFO for the user defined time (RXFTO register) and there is at 
least 1 entry in RX FIFO during this time, this bit is clear by write 1</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>EINTEN</name>
     <description>Extended Interrupt Enable Register.</description>
     <addressOffset>0x0035</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>RX_THD</name>
       <description>RX FIFO reach programmed trigger level, it is set when the RX FIFO reaches programmed trigger level (RT[2:0] in MR register). To clear the 
RXFT interrupt, write this bit 1</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RX_TO</name>
       <description>RX FIFO Timeout Indicator. It is set when there is no write or read from/in to RX FIFO for the user defined time (RXFTO register) and there is at 
least 1 entry in RX FIFO during this time, this bit is clear by write 1</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>RXTO</name>
     <description>RX FIFO Timeout Register.</description>
     <addressOffset>0x0036</addressOffset>
     <size>16</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>RX_TO</name>
       <description>RX FIFO Timeout</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
