analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/max32690.svd
   </registers>
  </peripheral>
<!--EMCC External Memory Cache Controller Registers.-->
  <peripheral>
   <name>FCR</name>
   <description>Function Control Register.</description>
   <baseAddress>0x40000800</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>FCTRL0</name>
     <description>Function Control 0.</description>
     <addressOffset>0x00</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>RDSGCSEL</name>
       <description>Hyperbys RDS Gray Code Select.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
      <field>
       <name>RDSGCSET</name>
       <description>Hyperbus RDS Set.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>HYPERCGDLY</name>
       <description>Hyperbus Clock Generator Delay.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
      <field>
       <name>USBCLKSEL</name>
       <description>USB Core Clock Select.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>I2C0DGEN0</name>
       <description>I2C0 SDA Pad Deglitcher enable.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Deglitcher disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Deglitcher enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I2C0DGEN1</name>
       <description>I2C0 SCL Pad Deglitcher enable.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Deglitcher disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Deglitcher enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I2C1DGEN0</name>
       <description>I2C1 SDA Pad Deglitcher enable.</description>
       <bitOffset>22</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Deglitcher disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Deglitcher enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I2C1DGEN1</name>
       <description>I2C1 SCL Pad Deglitcher enable.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Deglitcher disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Deglitcher enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I2C2DGEN0</name>
       <description>I2C2 SDA Pad Deglitcher enable.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Deglitcher disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Deglitcher enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I2C2DGEN1</name>
       <description>I2C2 SCL Pad Deglitcher enable.</description>
       <bitOffset>25</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Deglitcher disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Deglitcher enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>AUTOCAL0</name>
     <description>Automatic Calibration 0.</description>
     <addressOffset>0x04</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>ACEN</name>
       <description>Auto-calibration Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ACRUN</name>
       <description>Autocalibration Run.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>not</name>
         <description>Not Running.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>run</name>
         <description>Running.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDTRM</name>
       <description>Load Trim.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>GAININV</name>
       <description>Invert Gain.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>not</name>
         <description>Not Running.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>run</name>
         <description>Running.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ATOMIC</name>
       <description>Atomic mode.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>not</name>
         <description>Not Running.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>run</name>
         <description>Running.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>MU</name>
       <description>MU value.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>12</bitWidth>
      </field>
      <field>
       <name>HIRC96MACTMROUT</name>
       <description>HIRC96M Trim Value.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>9</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>AUTOCAL1</name>
     <description>Automatic Calibration 1.</description>
     <addressOffset>0x08</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>INITTRM</name>
       <description>Initial Trim Setting.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>9</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>AUTOCAL2</name>
     <description>Automatic Calibration 2</description>
     <addressOffset>0x0C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>DONECNT</name>
       <description>Auto-callibration Done Counter Setting.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
      <field>
       <name>ACDIV</name>
       <description>Auto-callibration Div Setting.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>13</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>URVBOOTADDR</name>
     <description>RISC-V Boot Address.</description>
     <addressOffset>0x10</addressOffset>
     <access>read-write</access>
    </register>
    <register>
     <name>URVCTRL</name>
     <description>RISC-V Control Register.</description>
     <addressOffset>0x14</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>MEMSEL</name>
       <description>RAM2, RAM3 exclusive ownership.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>IFLUSHEN</name>
       <description>URV instruction flush enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>XO32MKS</name>
     <description>RISC-V Control Register.</description>
     <addressOffset>0x18</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>CLK</name>
       <description>Kick Start XO Counter Setting</description>
       <bitOffset>0</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>EN</name>
       <description>Kick Start XO Enable</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DRIVER</name>
       <description>Kick Start XO Driver</description>
       <bitOffset>8</bitOffset>
       <bitWidth>3</bitWidth>
      </field>
      <field>
       <name>PULSE</name>
       <description>Kick Start XO 2X Pulse</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CLKSEL</name>
       <description>Kick Start XO Clock Select</description>
       <bitOffset>12</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>none</name>
         <description>No kick start clock.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>test</name>
         <description>Test Clock in P1.2 (TMR3[22]=1).</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ISO</name>
         <description>Internal secondary oscilator</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>IPO</name>
         <description>Internal Primary Oscilator</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>SARBUFCN</name>
     <description>TBD</description>
     <addressOffset>0x1C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>THRU_PAD_SW_EN</name>
       <description>TBD</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
      <field>
       <name>THRU_EN</name>
       <description>TBD</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAMP_EN</name>
       <description>TBD</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>THRU_RRI_EN</name>
       <description>TBD</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DIVSEL</name>
       <description>TBD</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TS0</name>
     <description>Temp Sensor trim0</description>
     <addressOffset>0x20</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>GAIN</name>
       <description>Unsigned gain for temp sensor normalization Temp degrees C = (ADC result * TS_GAIN) + TS_OFFSET.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>12</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TS1</name>
     <description>Temp Sensor trim1</description>
     <addressOffset>0x24</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>OFFSET</name>
       <description>Signed gain for temp sensor normalization Temp degrees C = (ADC result * TS_GAIN) + TS_OFFSET.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>14</bitWidth>
      </field>
      <field>
       <name>TS_OFFSET_SIGN</name>
       <description>Sign extension of TS_OFFSET[13:0]</description>
       <bitOffset>14</bitOffset>
       <bitWidth>18</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADCREFTRIM0</name>
     <description>Temp Sensor trim1</description>
     <addressOffset>0x28</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>VREFP</name>
       <description>Trimming code for VREFP output of reference buffer</description>
       <bitOffset>0</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>VREFM</name>
       <description>Trimming code for VREFM output of reference buffer</description>
       <bitOffset>8</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>VCM</name>
       <description>Trimming code for VCM output of reference buffer</description>
       <bitOffset>16</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>VX2_TUNE</name>
       <description>Controls tuning capacitor in fine DAC (offset binary)</description>
       <bitOffset>24</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADCREFTRIM1</name>
     <description>Temp Sensor trim1</description>
     <addressOffset>0x2C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>VREFP</name>
       <description>Trimming code for VREFP output of reference buffer</description>
       <bitOffset>0</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>VREFM</name>
       <description>Trimming code for VREFM output of reference buffer</description>
       <bitOffset>8</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>VCM</name>
       <description>Trimming code for VCM output of reference buffer</description>
       <bitOffset>16</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>VX2_TUNE</name>
       <description>Controls tuning capacitor in fine DAC (offset binary)</description>
       <bitOffset>24</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADCREFTRIM2</name>
     <description>Temp Sensor trim1</description>
     <addressOffset>0x30</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>IDRV_1P25</name>
       <description>Trimming code for reference buffer drive strength. 1.25V</description>
       <bitOffset>0</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>IBOOST_1P25</name>
       <description>Trimming value for extra drive current in reference buffer outputs. 2.048V</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>IDRV_2P048</name>
       <description>Trimming code for reference buffer drive strength. 2.048V</description>
       <bitOffset>8</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>IBOOST_2P048</name>
       <description>Trimming value for extra drive current in reference buffer outputs. 2.048V</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>VCM</name>
       <description>Trimming code for VCM output of reference buffer</description>
       <bitOffset>16</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>VX2_TUNE</name>
       <description>Controls tuning capacitor in fine DAC (offset binary)</description>
       <bitOffset>24</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
     </fields>
    </register>
