analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/max32690.svd
    <register>
     <name>PCLKDIS1</name>
     <description>Peripheral Clock Disable.</description>
     <addressOffset>0x48</addressOffset>
     <fields>
      <field>
       <name>BTLE</name>
       <description>BTLE Clock Disable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Clock enabled to the peripheral.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Clock disabled to the peripheral.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="BTLE">
       <name>UART2</name>
       <description>UART2 Clock Disable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>TRNG</name>
       <description>TRNG Clock Disable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>PUF</name>
       <description>PUF Clock Disable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>HPB</name>
       <description>HyperBus/Xccela Clock Disable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>SYSCACHE</name>
       <description>System Cache Clock Disable.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>SMPHR</name>
       <description>SMPHR Clock Disable.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>CAN0</name>
       <description>CAN0 Clock Disable.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>OWM</name>
       <description>One-Wire Clock Disable.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>SPI3</name>
       <description>SPI3 Clock Disable.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>SPI4</name>
       <description>SPI4 Clock Disable.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>CAN1</name>
       <description>CAN1 Clock Disable.</description>
       <bitOffset>19</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>SPIXR</name>
       <description>SPIXR Clock Disable.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>I2S</name>
       <description>I2S Clock Disable.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>I2C2</name>
       <description>I2C2 Clock Disable.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>WDT0</name>
       <description>Watch Dog Timer 0 Clock Disable.</description>
       <bitOffset>27</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="BTLE">
       <name>CPU1</name>
       <description>CPU1 Clock Disable.</description>
       <bitOffset>31</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>EVENTEN</name>
     <description>Event Enable Register.</description>
     <addressOffset>0x4C</addressOffset>
     <fields>
      <field>
       <name>DMA</name>
       <description>Enable DMA event. When this bit is set, a DMA event will cause an RXEV event to wake the CPU from WFE sleep mode.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RX</name>
       <description>Enable RXEV pin event. When this bit is set, RXEV event from the CPU is output to GPIO1.9.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TX</name>
       <description>Enable TXEV pin event. When this bit is set, TXEV event from the CPU is output to GPIO1.9.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>REVISION</name>
     <description>Revision Register.</description>
     <addressOffset>0x50</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>REVISION</name>
       <description>Manufacturer Chip Revision.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SYSIE</name>
     <description>System Status Interrupt Enable Register.</description>
     <addressOffset>0x54</addressOffset>
     <fields>
      <field>
       <name>ICEUNLOCK</name>
       <description>ARM ICE Unlock Interrupt Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>ECCERR</name>
     <description>ECC Error Register</description>
     <addressOffset>0x64</addressOffset>
     <fields>
      <field>
       <name>RAM0</name>
       <description>ECC System RAM0 Error Flag. Write 1 to clear.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM1</name>
       <description>ECC System RAM1 Error Flag. Write 1 to clear.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM2</name>
       <description>ECC System RAM2 Error Flag. Write 1 to clear.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM3</name>
       <description>ECC System RAM3 Error Flag. Write 1 to clear.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM4</name>
       <description>ECC System RAM4 Error Flag. Write 1 to clear.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM5</name>
       <description>ECC System RAM5 Error Flag. Write 1 to clear.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM6</name>
       <description>ECC System RAM6 Error Flag. Write 1 to clear.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ICACHE0</name>
       <description>ECC System ICACHE0 Error Flag. Write 1 to clear.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ICACHEXIP</name>
       <description>ECC System ICACHEXIP Error Flag. Write 1 to clear.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ECCCED</name>
     <description>ECC Not Double Error Detect Register</description>
     <addressOffset>0x68</addressOffset>
     <fields>
      <field>
       <name>RAM0</name>
       <description>ECC System RAM0 Error Flag. Write 1 to clear.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM1</name>
       <description>ECC System RAM1 Error Flag. Write 1 to clear.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM2</name>
       <description>ECC System RAM2 Error Flag. Write 1 to clear.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM3</name>
       <description>ECC System RAM3 Error Flag. Write 1 to clear.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM4</name>
       <description>ECC System RAM4 Error Flag. Write 1 to clear.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM5</name>
       <description>ECC System RAM5 Error Flag. Write 1 to clear.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM6</name>
       <description>ECC System RAM6 Error Flag. Write 1 to clear.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ICACHE0</name>
       <description>ECC System ICACHE0 Error Flag. Write 1 to clear.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ICACHEXIP</name>
       <description>ECC System ICACHEXIP Error Flag. Write 1 to clear.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ECCIE</name>
     <description>ECC IRQ Enable Register</description>
     <addressOffset>0x6C</addressOffset>
     <fields>
      <field>
       <name>RAM0</name>
       <description>ECC System RAM0 Error Flag. Write 1 to clear.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM1</name>
       <description>ECC System RAM1 Error Flag. Write 1 to clear.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM2</name>
       <description>ECC System RAM2 Error Flag. Write 1 to clear.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM3</name>
       <description>ECC System RAM3 Error Flag. Write 1 to clear.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM4</name>
       <description>ECC System RAM4 Error Flag. Write 1 to clear.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM5</name>
       <description>ECC System RAM5 Error Flag. Write 1 to clear.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM6</name>
       <description>ECC System RAM6 Error Flag. Write 1 to clear.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ICACHE0</name>
       <description>ECC System ICACHE0 Error Flag. Write 1 to clear.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ICACHEXIP</name>
       <description>ECC System ICACHEXIP Error Flag. Write 1 to clear.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ECCADDR</name>
     <description>ECC Error Address Register</description>
     <addressOffset>0x70</addressOffset>
     <fields>
      <field>
       <name>DADDR</name>
       <description>Data Address.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>14</bitWidth>
      </field>
      <field>
       <name>DB</name>
       <description>Data Error Bank.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DE</name>
       <description>DE Error.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TADDR</name>
       <description>Tag Address.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>14</bitWidth>
      </field>
      <field>
       <name>TB</name>
       <description>Tag Error Bank.</description>
       <bitOffset>30</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TE</name>
       <description>Tag Error.</description>
       <bitOffset>31</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BTLELDOCTRL</name>
     <description>BTLE LDO Control Register</description>
     <addressOffset>0x74</addressOffset>
     <fields>
      <field>
       <name>LDOBBEN</name>
       <description>LDOBB Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LDOBBPULLD</name>
       <description>LDOBB Pull Down.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LDOBBVSEL</name>
       <description>LDOBB Voltage Setting.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>0_85</name>
         <description>0.85V</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>0_9</name>
         <description>0.9V</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_0</name>
         <description>1.0V</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_1</name>
         <description>1.1V</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDORFEN</name>
       <description>LDORF Enable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LDORFPULLD</name>
       <description>LDORF Pull Down.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LDORFVSEL</name>
       <description>LDORF Voltage Setting.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>0_85</name>
         <description>0.85V</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>0_9</name>
         <description>0.9V</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_0</name>
         <description>1.0V</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1_1</name>
         <description>1.1V</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LDORFBYP</name>
       <description>LDORF Bypass Enable.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LDORFDISCH</name>
       <description>LDORF Discharge.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LDOBBBYP</name>
       <description>LDOBB Bypass Enable.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LDOBBDISCH</name>
       <description>LDOBB Discharge.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LDOBBENDLY</name>
       <description>LDOBB Enable Delay.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LDORFENDLY</name>
       <description>LDORF Enable Delay.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LDORFBYPENENDLY</name>
       <description>LDORF Bypass Enable Delay.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LDOBBBYPENENDLY</name>
       <description>LDOBB Bypass Enable Delay.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BTLELDODLY</name>
     <description>BTLE LDO Delay Register</description>
     <addressOffset>0x78</addressOffset>
     <fields>
      <field>
       <name>BYPDLYCNT</name>
       <description>Bypass Delay Count.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
      <field>
       <name>LDORFDLYCNT</name>
       <description>LDORF Delay Count.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>9</bitWidth>
      </field>
      <field>
       <name>LDOBBDLYCNT</name>
       <description>LDOBB Delay Count.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>9</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>GPR0</name>
     <description>General Purpose Register 0</description>
     <addressOffset>0x80</addressOffset>
    </register>
