analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/max32690.svd
   </registers>
  </peripheral>
<!--PT Pulse Train-->
  <peripheral derivedFrom="PT">
   <name>PT1</name>
   <description>Pulse Train 1</description>
   <baseAddress>0x4003C030</baseAddress>
  </peripheral>
<!--PT1 Pulse Train 1-->
  <peripheral derivedFrom="PT">
   <name>PT2</name>
   <description>Pulse Train 2</description>
   <baseAddress>0x4003C040</baseAddress>
  </peripheral>
<!--PT2 Pulse Train 2-->
  <peripheral derivedFrom="PT">
   <name>PT3</name>
   <description>Pulse Train 3</description>
   <baseAddress>0x4003C050</baseAddress>
  </peripheral>
<!--PT3 Pulse Train 3-->
  <peripheral derivedFrom="PT">
   <name>PT4</name>
   <description>Pulse Train 4</description>
   <baseAddress>0x4003C060</baseAddress>
  </peripheral>
<!--PT4 Pulse Train 4-->
  <peripheral derivedFrom="PT">
   <name>PT5</name>
   <description>Pulse Train 5</description>
   <baseAddress>0x4003C070</baseAddress>
  </peripheral>
<!--PT5 Pulse Train 5-->
  <peripheral derivedFrom="PT">
   <name>PT6</name>
   <description>Pulse Train 6</description>
   <baseAddress>0x4003C080</baseAddress>
  </peripheral>
<!--PT6 Pulse Train 6-->
  <peripheral derivedFrom="PT">
   <name>PT7</name>
   <description>Pulse Train 7</description>
   <baseAddress>0x4003C090</baseAddress>
  </peripheral>
<!--PT7 Pulse Train 7-->
  <peripheral derivedFrom="PT">
   <name>PT8</name>
   <description>Pulse Train 8</description>
   <baseAddress>0x4003C0A0</baseAddress>
  </peripheral>
<!--PT8 Pulse Train 8-->
  <peripheral derivedFrom="PT">
   <name>PT9</name>
   <description>Pulse Train 9</description>
   <baseAddress>0x4003C0B0</baseAddress>
  </peripheral>
<!--PT9 Pulse Train 9-->
  <peripheral derivedFrom="PT">
   <name>PT10</name>
   <description>Pulse Train 10</description>
   <baseAddress>0x4003C0C0</baseAddress>
  </peripheral>
<!--PT10 Pulse Train 10-->
  <peripheral derivedFrom="PT">
   <name>PT11</name>
   <description>Pulse Train 11</description>
   <baseAddress>0x4003C0D0</baseAddress>
  </peripheral>
<!--PT11 Pulse Train 11-->
  <peripheral derivedFrom="PT">
   <name>PT12</name>
   <description>Pulse Train 12</description>
   <baseAddress>0x4003C0E0</baseAddress>
  </peripheral>
<!--PT12 Pulse Train 12-->
  <peripheral derivedFrom="PT">
   <name>PT13</name>
   <description>Pulse Train 13</description>
   <baseAddress>0x4003C0F0</baseAddress>
  </peripheral>
<!--PT13 Pulse Train 13-->
  <peripheral derivedFrom="PT">
   <name>PT14</name>
   <description>Pulse Train 14</description>
   <baseAddress>0x4003C100</baseAddress>
  </peripheral>
<!--PT14 Pulse Train 14-->
  <peripheral derivedFrom="PT">
   <name>PT15</name>
   <description>Pulse Train 15</description>
   <baseAddress>0x4003C110</baseAddress>
  </peripheral>
<!--PT15 Pulse Train 15-->
  <peripheral>
   <name>PTG</name>
   <description>Pulse Train Generation</description>
   <groupName>Pulse_Train</groupName>
   <baseAddress>0x4003C000</baseAddress>
   <size>32</size>
   <access>read-write</access>
   <addressBlock>
    <offset>0</offset>
    <size>0x0020</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>PT</name>
    <description>Pulse Train IRQ</description>
    <value>59</value>
   </interrupt>
   <registers>
    <register>
     <name>ENABLE</name>
     <description>Global Enable/Disable Controls for All Pulse Trains</description>
     <addressOffset>0x0000</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>pt0</name>
       <description>Enable/Disable control for PT0</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt1</name>
       <description>Enable/Disable control for PT1</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt2</name>
       <description>Enable/Disable control for PT2</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt3</name>
       <description>Enable/Disable control for PT3</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt4</name>
       <description>Enable/Disable control for PT4</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt5</name>
       <description>Enable/Disable control for PT5</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt6</name>
       <description>Enable/Disable control for PT6</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt7</name>
       <description>Enable/Disable control for PT7</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt8</name>
       <description>Enable/Disable control for PT8</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt9</name>
       <description>Enable/Disable control for PT9</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt10</name>
       <description>Enable/Disable control for PT10</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt11</name>
       <description>Enable/Disable control for PT11</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt12</name>
       <description>Enable/Disable control for PT12</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt13</name>
       <description>Enable/Disable control for PT13</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt14</name>
       <description>Enable/Disable control for PT14</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt15</name>
       <description>Enable/Disable control for PT15</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>RESYNC</name>
     <description>Global Resync (All Pulse Trains) Control</description>
     <addressOffset>0x0004</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>pt0</name>
       <description>Resync control for PT0</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt1</name>
       <description>Resync control for PT1</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt2</name>
       <description>Resync control for PT2</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt3</name>
       <description>Resync control for PT3</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt4</name>
       <description>Resync control for PT4</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt5</name>
       <description>Resync control for PT5</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt6</name>
       <description>Resync control for PT6</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt7</name>
       <description>Resync control for PT7</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt8</name>
       <description>Resync control for PT8</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt9</name>
       <description>Resync control for PT9</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt10</name>
       <description>Resync control for PT10</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt11</name>
       <description>Resync control for PT11</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt12</name>
       <description>Resync control for PT12</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt13</name>
       <description>Resync control for PT13</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt14</name>
       <description>Resync control for PT14</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt15</name>
       <description>Resync control for PT15</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>STOP_INTFL</name>
     <description>Pulse Train Interrupt Flags</description>
     <addressOffset>0x0008</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>pt0</name>
       <description>Pulse Train 0 Stopped Interrupt Flag</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt1</name>
       <description>Pulse Train 1 Stopped Interrupt Flag</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt2</name>
       <description>Pulse Train 2 Stopped Interrupt Flag</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt3</name>
       <description>Pulse Train 3 Stopped Interrupt Flag</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt4</name>
       <description>Pulse Train 4 Stopped Interrupt Flag</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt5</name>
       <description>Pulse Train 5 Stopped Interrupt Flag</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt6</name>
       <description>Pulse Train 6 Stopped Interrupt Flag</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt7</name>
       <description>Pulse Train 7 Stopped Interrupt Flag</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt8</name>
       <description>Pulse Train 8 Stopped Interrupt Flag</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt9</name>
       <description>Pulse Train 9 Stopped Interrupt Flag</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt10</name>
       <description>Pulse Train 10 Stopped Interrupt Flag</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt11</name>
       <description>Pulse Train 11 Stopped Interrupt Flag</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt12</name>
       <description>Pulse Train 12 Stopped Interrupt Flag</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt13</name>
       <description>Pulse Train 13 Stopped Interrupt Flag</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt14</name>
       <description>Pulse Train 14 Stopped Interrupt Flag</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt15</name>
       <description>Pulse Train 15 Stopped Interrupt Flag</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>STOP_INTEN</name>
     <description>Pulse Train Interrupt Enable/Disable</description>
     <addressOffset>0x000C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>pt0</name>
       <description>Pulse Train 0 Stopped Interrupt Enable/Disable</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt1</name>
       <description>Pulse Train 1 Stopped Interrupt Enable/Disable</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt2</name>
       <description>Pulse Train 2 Stopped Interrupt Enable/Disable</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt3</name>
       <description>Pulse Train 3 Stopped Interrupt Enable/Disable</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt4</name>
       <description>Pulse Train 4 Stopped Interrupt Enable/Disable</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt5</name>
       <description>Pulse Train 5 Stopped Interrupt Enable/Disable</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt6</name>
       <description>Pulse Train 6 Stopped Interrupt Enable/Disable</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt7</name>
       <description>Pulse Train 7 Stopped Interrupt Enable/Disable</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt8</name>
       <description>Pulse Train 8 Stopped Interrupt Enable/Disable</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt9</name>
       <description>Pulse Train 9 Stopped Interrupt Enable/Disable</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt10</name>
       <description>Pulse Train 10 Stopped Interrupt Enable/Disable</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt11</name>
       <description>Pulse Train 11 Stopped Interrupt Enable/Disable</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt12</name>
       <description>Pulse Train 12 Stopped Interrupt Enable/Disable</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt13</name>
       <description>Pulse Train 13 Stopped Interrupt Enable/Disable</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt14</name>
       <description>Pulse Train 14 Stopped Interrupt Enable/Disable</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt15</name>
       <description>Pulse Train 15 Stopped Interrupt Enable/Disable</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SAFE_EN</name>
     <description>Pulse Train Global Safe Enable.</description>
     <addressOffset>0x0010</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>PT0</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT1</name>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT2</name>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT3</name>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT4</name>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT5</name>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT6</name>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT7</name>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT8</name>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT9</name>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT10</name>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT11</name>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT12</name>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT13</name>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT14</name>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT15</name>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SAFE_DIS</name>
     <description>Pulse Train Global Safe Disable.</description>
     <addressOffset>0x0014</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>PT0</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT1</name>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT2</name>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT3</name>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT4</name>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT5</name>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT6</name>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT7</name>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT8</name>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT9</name>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT10</name>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT11</name>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT12</name>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT13</name>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT14</name>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PT15</name>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
     </fields>
    </register>
