analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/max32690.svd
    <register>
     <name>READY_INTFL</name>
     <description>Pulse Train Ready Interrupt Flags</description>
     <addressOffset>0x0018</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>pt0</name>
       <description>Pulse Train 0 Ready Interrupt Flag</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt1</name>
       <description>Pulse Train 1 Ready Interrupt Flag</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt2</name>
       <description>Pulse Train 2 Ready Interrupt Flag</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt3</name>
       <description>Pulse Train 3 Ready Interrupt Flag</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt4</name>
       <description>Pulse Train 4 Ready Interrupt Flag</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt5</name>
       <description>Pulse Train 5 Ready Interrupt Flag</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt6</name>
       <description>Pulse Train 6 Ready Interrupt Flag</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt7</name>
       <description>Pulse Train 7 Ready Interrupt Flag</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt8</name>
       <description>Pulse Train 8 Ready Interrupt Flag</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt9</name>
       <description>Pulse Train 9 Ready Interrupt Flag</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt10</name>
       <description>Pulse Train 10 Ready Interrupt Flag</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt11</name>
       <description>Pulse Train 11 Ready Interrupt Flag</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt12</name>
       <description>Pulse Train 12 Ready Interrupt Flag</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt13</name>
       <description>Pulse Train 13 Ready Interrupt Flag</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt14</name>
       <description>Pulse Train 14 Ready Interrupt Flag</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt15</name>
       <description>Pulse Train 15 Ready Interrupt Flag</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>READY_INTEN</name>
     <description>Pulse Train Ready Interrupt Enable/Disable</description>
     <addressOffset>0x001C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>pt0</name>
       <description>Pulse Train 0 Ready Interrupt Enable/Disable</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt1</name>
       <description>Pulse Train 1 Ready Interrupt Enable/Disable</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt2</name>
       <description>Pulse Train 2 Ready Interrupt Enable/Disable</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt3</name>
       <description>Pulse Train 3 Ready Interrupt Enable/Disable</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt4</name>
       <description>Pulse Train 4 Ready Interrupt Enable/Disable</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt5</name>
       <description>Pulse Train 5 Ready Interrupt Enable/Disable</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt6</name>
       <description>Pulse Train 6 Ready Interrupt Enable/Disable</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt7</name>
       <description>Pulse Train 7 Ready Interrupt Enable/Disable</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt8</name>
       <description>Pulse Train 8 Ready Interrupt Enable/Disable</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt9</name>
       <description>Pulse Train 9 Ready Interrupt Enable/Disable</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt10</name>
       <description>Pulse Train 10 Ready Interrupt Enable/Disable</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt11</name>
       <description>Pulse Train 11 Ready Interrupt Enable/Disable</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt12</name>
       <description>Pulse Train 12 Ready Interrupt Enable/Disable</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt13</name>
       <description>Pulse Train 13 Ready Interrupt Enable/Disable</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt14</name>
       <description>Pulse Train 14 Ready Interrupt Enable/Disable</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>pt15</name>
       <description>Pulse Train 15 Ready Interrupt Enable/Disable</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
