analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/max32690.svd
    <register>
     <name>LPPWEN</name>
     <description>Low Power Peripheral Wakeup Enable Register.</description>
     <addressOffset>0x34</addressOffset>
     <fields>
      <field>
       <name>USBLS</name>
       <description> USB UTMI Linestate Detect Wakeup Enable. These bits allow wakeup from the corresponding USB linestate
signal(s) on transition(s) from low to high or high to low when PM.USBWKEN is set.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>USBVBUS</name>
       <description> USB VBUS Detect Wakeup Enable. This bit allows wakeup from the USB power supply on or off status.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AINCOMP0</name>
       <description> AINCOMP0 Wakeup Enable. This bit allows wakeup from the AINCOMP0.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>WDT0</name>
       <description> WDT0 Wakeup Enable. This bit allows wakeup from the WDT0.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>WDT1</name>
       <description> WDT1 Wakeup Enable. This bit allows wakeup from the WDT1.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CPU1</name>
       <description> CPU1 Wakeup Enable. This bit allows wakeup from the CPU1.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TMR0</name>
       <description> TMR0 Wakeup Enable. This bit allows wakeup from the TMR0.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TMR1</name>
       <description> TMR1 Wakeup Enable. This bit allows wakeup from the TMR1.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TMR2</name>
       <description> TMR2 Wakeup Enable. This bit allows wakeup from the TMR2.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TMR3</name>
       <description> TMR3 Wakeup Enable. This bit allows wakeup from the TMR3.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TMR4</name>
       <description> TMR4 Wakeup Enable. This bit allows wakeup from the TMR4.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TMR5</name>
       <description> TMR5 Wakeup Enable. This bit allows wakeup from the TMR5.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>UART0</name>
       <description> UART0 Wakeup Enable. This bit allows wakeup from the UART0.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>UART1</name>
       <description> UART1 Wakeup Enable. This bit allows wakeup from the UART1.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>UART2</name>
       <description> UART2 Wakeup Enable. This bit allows wakeup from the UART2.</description>
       <bitOffset>19</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>UART3</name>
       <description> UART3 Wakeup Enable. This bit allows wakeup from the UART3.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>I2C0</name>
       <description> I2C0 Wakeup Enable. This bit allows wakeup from the I2C0.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>I2C1</name>
       <description> I2C1 Wakeup Enable. This bit allows wakeup from the I2C1.</description>
       <bitOffset>22</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>I2C2</name>
       <description> I2C2 Wakeup Enable. This bit allows wakeup from the I2C2.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>I2S</name>
       <description> I2S Wakeup Enable. This bit allows wakeup from the I2S.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SPI0</name>
       <description> SPI0 Wakeup Enable. This bit allows wakeup from the SPI0.</description>
       <bitOffset>25</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LPCMP</name>
       <description> LPCMP Wakeup Enable. This bit allows wakeup from the LPCMP.</description>
       <bitOffset>26</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BTLE</name>
       <description>BTLE Wakeup Enable. This bit allows wakeup from the BTLE.</description>
       <bitOffset>27</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SPI1</name>
       <description> SPI1 Wakeup Enable. This bit allows wakeup from the SPI1.</description>
       <bitOffset>28</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SPI2</name>
       <description> SPI2 Wakeup Enable. This bit allows wakeup from the SPI2.</description>
       <bitOffset>29</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CAN0</name>
       <description>CAN0 Wakeup Enable. This bit allows wakeup from the CAN0.</description>
       <bitOffset>30</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CAN1</name>
       <description>CAN1 Wakeup Enable. This bit allows wakeup from the CAN1.</description>
       <bitOffset>31</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>GP0</name>
     <description>General Purpose Register 0</description>
     <addressOffset>0x48</addressOffset>
    </register>
    <register>
     <name>GP1</name>
     <description>General Purpose Register 1</description>
     <addressOffset>0x4C</addressOffset>
    </register>
