analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/max32690.svd
   </registers>
  </peripheral>
<!--RTC Real Time Clock and Alarm.-->
  <peripheral>
   <name>SEMA</name>
   <description>The Semaphore peripheral allows multiple cores in a system to cooperate when accessing shred resources.
                                     The peripheral contains eight semaphores that can be atomically set and cleared. It is left to the discretion of the software
                                     architect to decide how and when the semaphores are used and how they are allocated. Existing hardware does not have to be
                                     
                                     modified for this type of cooperative sharing, and the use of semaphores is exclusively within the software domain.</description>
   <baseAddress>0x4003E000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <dim>8</dim>
     <dimIncrement>4</dimIncrement>
     <name>SEMAPHORES[%s]</name>
     <description>Read to test and set, returns prior value. Write 0 to clear semaphore.</description>
     <addressOffset>0x00</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>sema</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>irq0</name>
     <description>Semaphore IRQ0 register.</description>
     <addressOffset>0x40</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>en</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>cm4_irq</name>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>mail0</name>
     <description>Semaphore Mailbox 0 register.</description>
     <addressOffset>0x44</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>data</name>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>irq1</name>
     <description>Semaphore IRQ1 register.</description>
     <addressOffset>0x48</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>en</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>rv32_irq</name>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>mail1</name>
     <description>Semaphore Mailbox 1 register.</description>
     <addressOffset>0x4C</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>data</name>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>status</name>
     <description>Semaphore status bits. 0 indicates the semaphore is free, 1 indicates taken.</description>
     <addressOffset>0x100</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>status0</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>status1</name>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>status2</name>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>status3</name>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>status4</name>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>status5</name>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>status6</name>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>status7</name>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>
<!--SEMA The Semaphore peripheral allows multiple cores in a system to cooperate when accessing shred resources.
                                     The peripheral contains eight semaphores that can be atomically set and cleared. It is left to the discretion of the software
                                     architect to decide how and when the semaphores are used and how they are allocated. Existing hardware does not have to be
                                     
                                     modified for this type of cooperative sharing, and the use of semaphores is exclusively within the software domain.-->
  <peripheral>
   <name>SIR</name>
   <description>System Initialization Registers.</description>
   <baseAddress>0x40000400</baseAddress>
   <access>read-only</access>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>SISTAT</name>
     <description>System Initialization Status Register.</description>
     <addressOffset>0x00</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>MAGIC</name>
       <description>Magic Word Validation. This bit is set by the system initialization block
              following power-up.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <usage>read</usage>
        <enumeratedValue>
         <name>magicNotSet</name>
         <description>Magic word was not set (OTP has not been initialized properly).</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>magicSet</name>
         <description>Magic word was set (OTP contains valid settings).</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CRCERR</name>
       <description>CRC Error Status. This bit is set by the system initialization block
              following power-up.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <usage>read</usage>
        <enumeratedValue>
         <name>noError</name>
         <description>No CRC errors occurred during the read of the OTP memory block.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>error</name>
         <description>A CRC error occurred while reading the OTP. The address of the failure
                  location in the OTP memory is stored in the ERRADDR register.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>SIADDR</name>
     <description>Read-only field set by the SIB block if a CRC error occurs during the read of
          the OTP memory. Contains the failing address in OTP memory (when CRCERR equals 1).</description>
     <addressOffset>0x04</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>ERRADDR</name>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BTLE_LDO_TRIM</name>
     <description>BTLE LDO Trim register.</description>
     <addressOffset>0x28</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>RF</name>
       <description>RF LDO trim value.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>5</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>BB</name>
       <description>BB LDO trim value.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>5</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>FSTAT</name>
     <description>funcstat register.</description>
     <addressOffset>0x100</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>FPU</name>
       <description>FPU Function.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>USB</name>
       <description>USB Function.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ADC</name>
       <description>ADC Function.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SPIXIP</name>
       <description>SPIXIP Function.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>HBC</name>
       <description>HBC Function.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SMPHR</name>
       <description>SMPHR function.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>BTLE</name>
       <description>BTLE function.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>SFSTAT</name>
     <description>Security function status register.</description>
     <addressOffset>0x104</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>TRNG</name>
       <description> TRNG Function.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AES</name>
       <description>AES Block.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SHA</name>
       <description>SHA Block.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>MAA</name>
       <description>MAA Block.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
